run/navalFoamVariant2/floatingBox6DOF/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 0.1;

vertices
(
    (-10 -5 -0.1)
    (-1 -5 -0.1)
    ( 1 -5 -0.1)
    ( 10 -5 -0.1)

    (-10 -0.3 -0.1)
    (-1 -0.3 -0.1)
    ( 1 -0.3 -0.1)
    ( 10 -0.3 -0.1)

    (-10  0.3 -0.1)
    (-1  0.3 -0.1)
    ( 1  0.3 -0.1)
    ( 10  0.3 -0.1)

    (-10  5 -0.1)
    (-1  5 -0.1)
    ( 1  5 -0.1)
    ( 10  5 -0.1)

    (-10 -5  0.1)
    (-1 -5  0.1)
    ( 1 -5  0.1)
    ( 10 -5  0.1)

    (-10 -0.3  0.1)
    (-1 -0.3  0.1)
    ( 1 -0.3  0.1)
    ( 10 -0.3  0.1)

    (-10  0.3  0.1)
    (-1  0.3  0.1)
    ( 1  0.3  0.1)
    ( 10  0.3  0.1)

    (-10  5  0.1)
    (-1  5  0.1)
    ( 1  5  0.1)
    ( 10  5  0.1)
);

blocks
(
    hex (0 1 5 4 16 17 21 20) (40 30 1) simpleGrading (0.25 1 1)
    hex (1 2 6 5 17 18 22 21) (30 30 1) simpleGrading (1 1 1)
    hex (2 3 7 6 18 19 23 22) (40 30 1) simpleGrading (4 1 1)

    hex (4 5 9 8 20 21 25 24) (40 12 1) simpleGrading (0.25 1 1)
    hex (6 7 11 10 22 23 27 26) (40 12 1) simpleGrading (4 1 1)

    hex (8 9 13 12 24 25 29 28) (40 30 1) simpleGrading (0.25 1 1)
    hex (9 10 14 13 25 26 30 29) (30 30 1) simpleGrading (1 1 1)
    hex (10 11 15 14 26 27 31 30) (40 30 1) simpleGrading (4 1 1)
);

edges
(
);

patches
(
    wall barge
    (
        (5 21 22 6)
        (6 22 26 10)
        (10 26 25 9)
        (9 25 21 5)
    )

    patch left
    (
        (0 16 20 4)
        (4 20 24 8)
        (8 24 28 12)
    )

    patch right
    (
        (3 7 23 19)
        (7 11 27 23)
        (11 15 31 27)
    )

    patch bottom
    (
        (0 1 17 16)
        (1 2 18 17)
        (2 3 19 18)
    )

    patch top
    (
        (12 28 29 13)
        (13 29 30 14)
        (14 30 31 15)
    )

    empty frontAndBack
    (
        // Back
        (0 4 5 1)
        (1 5 6 2)
        (2 6 7 3)
        (4 8 9 5)
        (6 10 11 7)
        (8 12 13 9)
        (9 13 14 10)
        (10 14 15 11)

        // Front
        (16 17 21 20)
        (17 18 22 21)
        (18 19 23 22)
        (20 21 25 24)
        (22 23 27 26)
        (24 25 29 28)
        (25 26 30 29)
        (26 27 31 30)
    )
);

mergePatchPairs
();


// ************************************************************************* //
