run/navalFoamVariant2/floatingBox6DOF/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pd
    {
        solver              CG;
        preconditioner
        {
            preconditioner  AMG;
            cycle           W-cycle;
            policy          AAMG;
            nPreSweeps      0;
            nPostSweeps     2;
            groupSize       4;
            minCoarseEqns   20;
            nMaxLevels      100;
            scale           on;
            smoother        ILU;
        }

        minIter           0;
        maxIter           100;
        tolerance         1e-7;
        relTol            0.0;
    };

    pdFinal
    {
        solver              CG;
        preconditioner
        {
            preconditioner  AMG;
            cycle           W-cycle;
            policy          AAMG;
            nPreSweeps      0;
            nPostSweeps     2;
            groupSize       4;
            minCoarseEqns   20;
            nMaxLevels      100;
            scale           on;
            smoother        ILU;
        }

        minIter           0;
        maxIter           200;
        tolerance         1e-7;
        relTol            0.0;
    };

    alpha1
    {
        solver            BiCGStab;
        preconditioner    Cholesky;

        minIter           0;
        maxIter           500;
        tolerance         1e-8;
        relTol            0.0;
    };

    U
    {
        solver            BiCGStab;
        preconditioner    Cholesky;

        minIter           0;
        maxIter           500;
        tolerance         1e-8;
        relTol            0.0;
    };
}

PISO
{
    cAlpha          1;
}


PIMPLE
{
    pRefPoint       (0.9 0.4 0.05);
    pRefValue       0.0;

    nCorrectors        6;
    nOuterCorrectors   2;
    nNonOrthogonalCorrectors 0;

    nAlphaSubCycles 1;

    singlePhase     yes;
    implicitAlpha   on;
    implicitP       on;

    correctPhi      off;
    checkMeshCourantNo  on;

    limitMagU       5;
    startMotionTime 0.001;
}


relaxationFactors
{
    U          0.8;
    pd         0.6;

    p          0.5;
}


// ************************************************************************* //
