run/navalFoamVariant2/floatingBox6DOF/system/tetFemSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          tetFemSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
//     motionU
//     {
//         solver           CG;
//         preconditioner   Cholesky;

//         minIter          0;
//         maxIter          500;
//         tolerance        1e-7;
//         relTol           0.01;
//     };

    motionU
    {
        solver            amgSolver;
        cycle             W-cycle;
        policy            AAMG;
        nPreSweeps        0;
        nPostSweeps       2;
        groupSize         4;
        minCoarseEqns     20;
        nMaxLevels        100;
        scale             on;
        smoother          ILU;

        minIter           0;
        maxIter           100;
        tolerance         1e-7;
        relTol            0.01;
    };
}


// ************************************************************************* //
